app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "tittle", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-25 16:43:31.907878"], ["text", "Alexis aime les pieds de girafes"], ["tittle", "Alexis pd"], ["updated_at", "2014-09-25 16:43:31.907878"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["text", "Alexis aime les pieds de girafes avec du parmesan"], ["updated_at", "2014-09-25 16:43:58.178478"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)